## 🧾 Terraform Plan for `sec_guardduty`

> ⚠️ Review this carefully before applying changes

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.guardduty_advanced.aws_guardduty_detector.this["eu-west-1"] will be created
  + resource "aws_guardduty_detector" "this" {
      + account_id                   = (known after apply)
      + arn                          = (known after apply)
      + enable                       = true
      + finding_publishing_frequency = "FIFTEEN_MINUTES"
      + id                           = (known after apply)
      + tags                         = {
          + "Environment" = "production"
          + "Owner"       = "SecurityTeam"
        }
      + tags_all                     = {
          + "Environment" = "production"
          + "Owner"       = "SecurityTeam"
        }

      + datasources {
          + kubernetes {
              + audit_logs {
                  + enable = true
                }
            }
          + malware_protection {
              + scan_ec2_instance_with_findings {
                  + ebs_volumes {
                      + enable = true
                    }
                }
            }
          + s3_logs {
              + enable = true
            }
        }
    }

  # module.guardduty_advanced.aws_guardduty_detector.this["us-east-1"] will be created
  + resource "aws_guardduty_detector" "this" {
      + account_id                   = (known after apply)
      + arn                          = (known after apply)
      + enable                       = true
      + finding_publishing_frequency = "FIFTEEN_MINUTES"
      + id                           = (known after apply)
      + tags                         = {
          + "Environment" = "production"
          + "Owner"       = "SecurityTeam"
        }
      + tags_all                     = {
          + "Environment" = "production"
          + "Owner"       = "SecurityTeam"
        }

      + datasources {
          + kubernetes {
              + audit_logs {
                  + enable = true
                }
            }
          + malware_protection {
              + scan_ec2_instance_with_findings {
                  + ebs_volumes {
                      + enable = true
                    }
                }
            }
          + s3_logs {
              + enable = true
            }
        }
    }

  # module.guardduty_advanced.aws_guardduty_organization_admin_account.this[0] will be created
  + resource "aws_guardduty_organization_admin_account" "this" {
      + admin_account_id = "123456789012"
      + id               = (known after apply)
    }

  # module.guardduty_advanced.aws_guardduty_publishing_destination.this[0] will be created
  + resource "aws_guardduty_publishing_destination" "this" {
      + destination_arn  = "arn:aws:sns:us-east-1:123456789012:gd-findings"
      + destination_type = "S3"
      + detector_id      = (known after apply)
      + id               = (known after apply)
      + kms_key_arn      = "arn:aws:kms:us-east-1:123456789012:key/your-kms-key-id"
    }

  # module.guardduty_advanced.aws_guardduty_publishing_destination.this[1] will be created
  + resource "aws_guardduty_publishing_destination" "this" {
      + destination_arn  = "arn:aws:sns:us-east-1:123456789012:gd-findings"
      + destination_type = "S3"
      + detector_id      = (known after apply)
      + id               = (known after apply)
      + kms_key_arn      = "arn:aws:kms:us-east-1:123456789012:key/your-kms-key-id"
    }

  # module.guardduty_basic.aws_guardduty_detector.this["us-east-1"] will be created
  + resource "aws_guardduty_detector" "this" {
      + account_id                   = (known after apply)
      + arn                          = (known after apply)
      + enable                       = true
      + finding_publishing_frequency = "FIFTEEN_MINUTES"
      + id                           = (known after apply)
      + tags                         = {
          + "Environment" = "security"
          + "Project"     = "guardduty"
        }
      + tags_all                     = {
          + "Environment" = "security"
          + "Project"     = "guardduty"
        }

      + datasources {
          + kubernetes {
              + audit_logs {
                  + enable = true
                }
            }
          + malware_protection {
              + scan_ec2_instance_with_findings {
                  + ebs_volumes {
                      + enable = true
                    }
                }
            }
          + s3_logs {
              + enable = true
            }
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

<!-- Sticky Pull Request Comment -->